НВ_Доработки/DataProcessors/СБПБанкТочка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СБПБанкТочка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>qrcId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>NotStarted - операции по QR-коду не существует, Received - операция в обработке, InProgress - операция в обработке, Accepted - операция завершена успешно, Rejected - операция отклонена</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГенерации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_height</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_mediaType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_content</Name>
					<Comment>содержимое изображения (для image/png - в кодировке base64)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>payload</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>qrcType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

НВ_Доработки/DataProcessors/СБПБанкТочка/Forms/ФормаСозданияНового/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЗаписьРегистра = РегистрыСведений.СБП_QRКоды.СоздатьМенеджерЗаписи();
	//ЗаписьРегистра.Заказ = Параметры.Заказ;
	//ЗаписьРегистра.qrcId = Запись.qrcId;
	//ЗаписьРегистра.Прочитать();
	//Если ЗаписьРегистра.Выбран() Тогда //значит такой записи нет
	//  	ДД = Base64Значение(ЗаписьРегистра.imageParams_content.Получить());
	//	СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Новый Картинка(ДД, Ложь), УникальныйИдентификатор);
	//КонецЕсли;
	Если Параметры.Свойство("Заказ") Тогда
		Объект.Заказ = Параметры.Заказ.Ссылка;
		Объект.Сумма = Параметры.Заказ.СуммаДокумента;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьQRКодНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Данные = Обработка.ПолучитьQRКодПоЗаказу(Объект.Заказ);
	Если Данные.Свойство("QRКод") Тогда
		Объект.Статус                = Данные.QRКод.Статус;
		Объект.ДатаГенерации         = Данные.QRКод.ДатаГенерации;
		Объект.imageParams_width     = Данные.QRКод.imageParams_width;
		Объект.imageParams_height    = Данные.QRКод.imageParams_height;
		Объект.imageParams_mediaType = Данные.QRКод.imageParams_mediaType;
		ДД = Base64Значение(Данные.QRКод.imageParams_content);
		СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Новый Картинка(ДД, Ложь), УникальныйИдентификатор);
		Объект.imageParams_content   = Данные.QRКод.imageParams_content;
		Объект.payload               = Данные.QRКод.payload;
		Объект.qrcType               = Данные.QRКод.qrcType;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьQRКод(Команда)
	//сумма ссылки ограничена константой "Максимальная сумма в ссылке СБП",
	//если у пользователя нет права создавать ссылки сверх неё
	ПроверкаЛимита = НВД_ОбщийМодульСервер.ПроверитьЛимитСуммыСсылкиСБП(Объект.Заказ, Объект.Сумма);
	Если НЕ ПроверкаЛимита.Разрешено Тогда
		ПоказатьПредупреждение(, ПроверкаЛимита.ТекстОтказа);
		Возврат;
	КонецЕсли;
	
	ПолучитьQRКодНаСервере();

	// для обновления Реквизитов
	//ЭтаФорма.Прочитать();
	//ОповеститьОбИзменении
	// Обновление данных
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры
